MySQL 서버는 MySQL 엔진과 스토리지 엔진으로 구분할 수 있음

## MySQL 엔진 아키텍처

- **MySQL 엔진**
    - 쿼리를 작성하고 튜닝할 때 필요
    - 커넥션 핸들러: 클라이언트 접속 및 쿼리 요청 처리
    - SQL 파서, 전처리기
    - 옵티마이저
    - 표준 SQL 문법을 지원하므로 쿼리는 타 DBMS와 호환 가능
- **스토리지 엔진**
    - 실제 데이터를 디스크 스토리지에 저장하거나 읽어오는 부분
    - MySQL 엔진과 달리 여러 개를 동시에 사용할 수 있음
        - 테이블이 사용할 스토리지 엔진을 지정할 수 있음
- **핸들러 API**
    - 핸들러 요청: MySQL 엔진의 쿼리 실행기에서 각 스토리지 엔진에 쓰기 또는 읽기를 요청하는 것
    - 핸들러 요청에 사용되는 것이 핸들러 API
    - `SHOW GLOBAL STATUS LIKE 'Handler%'` 를 통해 작업 횟수를 확인할 수 있음
        - `SHOW GLOBAL STATUS` 는 서버의 상태 변수 조회, `LIKE 'Handler%'` 는 Handler로 시작하는 패턴

### **MySQL 스레딩 구조**

- MySQL 서버는 프로세스 기반이 아닌 스레드 기반으로 작동
    - 그러나 MySQL이 실행되면 두 개의 프로세스를 확인할 수 있음
    → mysqld는 실제 서비스 데몬, mysqld_safe는 MySQL이 비정상 종료되는 경우 다시 기동하는 역할
- **포그라운드**(Foreground) 스레드, **백그라운드**(Background) 스레드로 구분
- `performance_schema` 데이터베이스의 `threads` 테이블을 통해 확인 가능
- **포그라운드 스레드(클라이언트 스레드)**
    - 주로 각 클라이언트 사용자가 요청하는 쿼리 문장을 처리
    → 적어도 MySQL 서버에 접속된 클라이언트의 수만큼 존재
    - 클라이언트 사용자가 작업을 마치고 커넥션 종료 시 그 스레드는 스레드 캐시로 돌아감
        - 근데 일정 개수 이상의 스레드가 캐시에 대기 중이면 그냥 종료
        ← 시스템 변수로 설정
        - MySQL은 스레드 구조이므로 세션 생성 비용이 비교적 적음
    - 데이터를 MySQL의 버퍼나 캐시로부터 가져오거나 직접 디스크의 데이터나 인덱스 파일로부터 데이터를 읽어와서 작업을 처리
    - 쓰기 작업
        - MyISAM 테이블은 쓰기 작업도 포그라운드 스레드가 처리
        - InnoDB 테이블은 버퍼나 캐시까지만 포그라운드, 버퍼로부터 디스크는 백그라운드
        - 즉 InnoDB에서는 메모리에 대한 쓰기 작업만
- **백그라운드 스레드**
    - **Master thread**: 백그라운드 스레드에 대한 관리 및 다양한 작업들의 스케줄링 담당
        - 과거엔 하드웨어 리소스와 직접적으로 연결되는 일을 많이 했으나 버전 업에 따라 분리되는 추세
    - **Change Buffer thread:** insert buffer(change buffer)를 병합하는 스레드
        - change buffer: 보조 인덱스 I/O 성능 향상을 위한 버퍼
            - 보조 인덱스는 정렬되지 않아 최신 상태로 유지하는 데에 I/O 오버헤드가 크므로 변경 사항을 캐싱해서 성능 올림
        - 읽기 작업에 의해 페이지가 버퍼 풀에 로드될 때 버퍼링된 변경 사항을 병합
    - **Log thread:** 로그를 디스크로 기록
        - 관계형 데이터베이스에서 ACID를 위해 writer ahead log 기법을 사용하는데 이 때 사용
        - 트랜잭션 로그 작성
    - **Write thread:** 버퍼 풀의 데이터를 디스크에 기록
        - 아주 많은 작업을 백그라운드로 처리하므로 개수를 여러 개 둠(2~4 정도)
        - 지연 처리될 수 있으므로 대부분 쓰기 작업을 버퍼링해서 일괄 처리하는 기능이 있음
        → 그래서 InnoDB에서는 데이터의 변경 저장을 기다리지 않아도 됨
    - **Read thread:** 다양한 읽기 작업을 처리
        - 읽기 작업은 지연되면 안되므로 주로 클라이언트 스레드에서 처리
        - 그럼 얘는 언제 씀?
        - 아무튼 그래서 쓰기 스레드와 달리 많이 설정할 필요가 없음
    - **Page Cleaner thread:** 버퍼 풀에 있는 dirty page를 flush
        - 원래는 마스터 스레드였는데 분리됨
    - **Purge thread:** Marking 처리(rollback)된 row를 제거하는 역할
        - 이거도 마스터 스레드에서 분리

### **메모리 할당 및 사용 구조**

- 글로벌 메모리 영역과 로컬 메모리 영역으로 이루어짐
- 글로벌 영역은 서버가 시작될 때 운영체제로부터 할당됨
← 시스템 변수로 설정해 둔 만큼 생각해도 됨
- MySQL 서버 내에 존재하는 스레드들이 공유해서 사용하는 공간인지 여부에 따라 구분
- **글로벌 메모리 영역**
    - 스레드 수와 무관하게 하나(필요에 따라 늘어날 수도)의 공간만 할당됨
    - 모든 스레드에 의해 공유됨
    - 테이블 캐시, InnoDB 버퍼 풀, InnoDB 어댑티브 해시 인덱스, InnoDB 리두 로그 버퍼
- **로컬 메모리 영역(= 세션/커넥션 메모리영역)**
    - 클라이언트 스레드가 쿼리를 처리하는 데 사용하는 메모리 영역
    - 각 스레드별로 독립적으로 할당됨
    - 공유되지 않음
    - 각 쿼리의 용도별로 필요할 때만 공간이 할당됨(대표적으로 정렬, 조인 버퍼)
    - 커넥션이 열려 있는 동안 계속 할당된 상태인 공간(커넥션, 결과 버퍼)도 있고 쿼리 실행 순간에만 할당되는 공간(소트, 조인 버퍼)이 있음
    - 정렬 버퍼, 조인 버퍼, 바이너리 로그 캐시, 네트워크 버퍼

### **플러그인 스토리지 엔진 모델**

- 스토리지 엔진 외에도 전문 검색 검색어 파서, 사용자 인증 증의 작업을 플러그인으로 구현해서 제공
- 기본적으로 제공되는 스토리지 엔진 이외에 부가적인 기능을 더 제공하는 스토리지 엔진이 필요할 수 있잖아
- InnoDB 스토리지 엔진, validate_password 컴포넌트, query_rewrite 플러그인 등
- 핸들러: 프로그래밍 언어에서 어떤 기능을 호출하기 위해 사용하는 객체
    - MySQL 엔진이 각 스토리지 엔진에게 읽기/쓰기를 명령하려면 반드시 핸들러를 통해야 함
- 복잡한 쿼리 작업(SORT, JOIN)은 MySQL 엔진에서 처리되고 데이터 읽기/쓰기만 스토리지 엔진에서 처리된다
- `SHOW ENGINES` 를 통해  스토리지 엔진을 확인 가능
- `SHOW PLUGINS` 로 스토리지 엔진뿐 아니라 플러그인도 확인 가능
- 단점이 있음
    - 플러그인은 MySQL 서버와만 인터페이스할 수 있고 서로는 통신 불가
    - 플러그인은 MySQL 서버의 변수와 함수를 직접 호출하므로 안전하지 않음(캡슐화가 안됨)
    - 상호 의존 관계를 설정할 수 없어서 초기화가 어렵스
- **컴포넌트**
    - MySQL 8.0부터 기존 플러그인 아키텍처를 대체하기 위해 컴포넌트 아키텍처가 지원됨
    - 비밀번호 검증 기능을 컴포넌트로 개선
    - `INSTALL COMPONENT` 로 설치
    - `SELECT * FROM mysql.component` 로 확인

### 쿼리 실행 구조

- **쿼리 파서**
    - 사용자 요청으로 들어온 쿼리 문장을 토큰으로 분리해 트리 형태의 구조로 만드는 작업
    - 토큰: MySQL이 인식할 수 있는 최소 단위의 어휘나 기호
    - 기본 문법 오류는 여기서 발견되고 오류 메시지를 전달함
- **전처리기**
    - 파서 트리를 기반으로 문장에 구조적인 문제점이 있는지 확인
    - 각 토큰을 테이블 이름, 칼럼 이름, 내장 함수와 같은 개체에 매핑해 존재 여부 및 접근 권한 등을 확인함
    - 존재하지 않거나 권한이 안되면 여기서 걸러짐
- **옵티마이저**
    - 사용자의 요청으로 들어온 쿼리 문장을 가장 빠르게 처리할지 결정하는 역할
    - 이 책에선 대부분 옵티마이저의 선택과 이를 개선하는 방법을 설명함
- **실행 엔진**
    - 만들어진 계획대로 핸들러에게 요청하고 이 결과를 다시 다른 핸들러의 요청으로 연결하는 역할
- **핸들러(스토리지 엔진)**
    - MySQL 실행 엔진의 요청에 따라 데이터 읽기/쓰기를 담당
    - InnoDB 스토리지 엔진, MyISAM 스토리지 엔진
- **복제(Replication)**
- **쿼리 캐시**
    - SQL의 실행 결과를 메모리에 캐시하고 동일 SQL 쿼리가 실행되면 즉시 반환
    - 테이블 데이터 변경 시 변경된 테이블과 관련된 캐시를 모두 삭제해야 하므로 동시 처리 성능 저하를 유발
    - MySQL 서버가 발전하면서 많은 버그의 원인이 되기도 함
    - 결국 MySQL 8.0으로 올라오면서 완전히 제거됨

### 스레드 풀

엔터프라이즈 에디션은 제공하지만 커뮤니티 에디션은 제공하지 않음. 이 챕터에서는 **Percona Server에서 제공되는 스레드 풀 기능**을 설명

엔터프라이즈 에디션에서 MySQL 서버 프로그램에 내장된 것과 달리 Percona Server에서는 **플러그인 형태**로 작동함 → 커뮤니티 에디션에서 사용하려면 동일 버전의 Percona Server에서 플러그인을 설치해서 사용하면 됨

스레드 풀은 내부적으로 스레드 개수를 줄여서 **서버의 자원 소모를 줄이는 것**이 목적. 동시에 실행 중인 스레드들을 CPU가 최대한 잘 처리하는 수준으로 줄여서 빨리 처리하게 하는 기능
→ 따라서 실제 서비스에서 눈에 띄는 성능 향상을 보여주는 일은 드물다. 쿼리 처리가 더 느려지는 일도 생길 수도

하지만 잘 유도하면 컨텍스트 스위치를 줄여 오버헤드를 낮출 수 있음

- 기본적으로 CPU 코어의 개수만큼 스레드 그룹을 생성
← 시스템 변수를 변경해서 조정 가능, 근데 코어와 개수를 맞추는 것이 좋다
- MySQL 서버가 처리해야 할 요청이 생기면 스레드 풀로 처리를 이관함
→ 만약 이미 스레드 풀이 처리 중인 작업이 있다면 추가로 더 받아들여 처리함(이거도 시스템 변수로 조정). 이 값이 너무 크면 스케줄링할 스레드의 수가 많아져 오히려 비효율적으로 됨

모든 스레드 그룹의 스레드들이 작업 중이면 스레드 풀은 새로운 스레드를 추가할지 기다릴지 여부를 판단해야 함.
→ 타이머 스레드가 주기적으로 그룹의 상태를 체크해 일정 시간(이거도 시스템 변수) 동안 작업을 끝내지 못하면 새로 생성. 그래도 시스템 변수의 최대 개수를 넘길 순 없다

응답 시간에 민감할 경우 일정 시간 시스템 변수를 잘 조정해야 한다. 근데 0에 가까운 값을 설정할 바엔 스레드 풀을 사용하지 않는 편이 나을 수 있음

- 선순위 큐와 후순위 큐를 이용해 특정 트랜잭션/쿼리를 우선 처리할 수 있는 기능도 제공
- 잠금을 빨리 해제해서 경합을 낮출 수 있고 이를 통해 처리 성능 향상을 기대할 수 있음

### 트랜잭션 지원 메타데이터

- **메타데이터**(또는 데이터 딕셔너리): 테이블의 구조 정보와 스토어드 프로그램 등의 정보
- 원래는 파일 기반이었는데 이는 트랜잭션 지원이 안되므로 깨질 수 있음
- 8.0 버전부터 InnoDB의 테이블에 저장하도록 개선
- 시스템 테이블: MySQL 서버가 작동하는 데 기본적으로 필요한 테이블
    - 대표적으로 사용자의 인증과 권한에 관련된 테이블
    - 이를 InnoDB 스토리지 엔진을 사용하도록 개선
- 실제 mysql DB의 테이블 목록에서 볼 순 없고 뷰를 통해 조회할 수 있음
- 트랜잭션을 통해 데이터가 깨지지 않게 됨
- 근데 MyISAM이나 CSV 같은 스토리지 엔진에서는 여전함
    - 따라서 SDI 파일을 사용

---

## InnoDB 스토리지 엔진 아키텍처

- MySQL 스토리지 엔진 중 가장 많이 사용됨
- 거의 유일하게 레코드 기반의 잠금을 제공 → 높은 동시성 처리가 가능하고 안정적이고 성능도 굿
- **프라이머리 키에 의한 클러스터링**
    - InnoDB의 모든 테이블은 기본적으로 프라이머리 키를 기준으로 클러스터링되어 저장됨
    → 키 값의 순서대로 디스크에 저장된다는 뜻
    - 모든 세컨더리 인덱스는 레코드 주소 대신 프라이머리 키 값을 논리적인 주소로 사용함
    - 프라이머리 키가 클러스터링 인덱스이므로 레인지 스캔이 상당히 빨리 처리됨
    → 쿼리의 실행 계획에서 프라이머리 키는 다른 보조 인덱스에 비해 비중이 높게 설정됨
    - MyISAM에서는 클러스터링 키를 지원하지 않음
        - 따라서 프라이머리 키와 세컨더리 인덱스는 구조적으로 같다. 유니크 제약을 가진 세컨더리 인덱스인 것
        - 모든 인덱스는 물리적인 레코드의 주소 값을 갖고 있음
- **외래 키 지원**
    - InnoDB 스토리지 엔진 레벨에서 지원하므로 MyISAM, MEMORY 테이블에서는 사용 불가
    - 외래 키는 DB 서버 운영의 불편함 때문에 서비스용 DB에서 생성하지 않는 경우도 잦지만 개발 환경의 DB에서는 좋은 가이드 역할
    - InnoDB에서 외래 키는 부모 - 자식 테이블 모두 해당 칼럼에 인덱스 생성이 필요함
        - 변경 시 두 테이블에서 다 데이터가 있는지 확인하는 작업이 필요하므로 잠금이 전파되고 데드락 발생 확률이 올라가므로 주의하는 것이 좋다~
    - 수동 데이터 적재나 스키마 변경 등의 작업이 실패할 수도 있음
        - 관계를 파악해서 순서대로 작업해야 함
        - 복잡하면 간단하지 않다
        - 긴급 조치가 필요할 때 곤란해질 수도..ㅋ
    - foreign_key_checks 시스템 변수를 OFF로 설정하면 일시적으로 외래 키 관계 체크 작업을 멈출 수 있음
        - 근데 그래도 일관성을 맞춰줘야 하겠지?

### MVCC(Multi Version Concurrency Control)

- 잠금을 사용하지 않는 일관된 읽기를 제공하는 것이 목적
- 일반적으로 레코드 레벨의 트랜잭션을 지원하는 DBMS가 제공하는 기능
- InnoDB에서는 언두 로그(Undo Log)를 통해 구현
- 멀티 버전: 하나의 레코드에 대해 여러 버전이 동시에 관리된다는 의미
- `UPDATE member SET m_area='경기' WHERE m_id=12` 라는 쿼리를 실행하면
    - 커밋 실행 여부와 상관 없이 버퍼 풀에는 “경기”인 값이 들어감
    - 변경 전 값인 “서울”은 언두 로그에 복사
    - 데이터 파일(디스크)에는 업데이트 되었을 수도 아닐 수도
    - 이 때 다른 사용자가 작업 중인 레코드를 조회하면 어디를 참조?
    → 트랜잭션 격리 수준에 따라 다름
    - READ_UNCOMMITTED인 경우 버퍼 풀의 데이터를, READ_COMMITTED 이상의 경우 언두 영역의 데이터를 반환
    - 이러한 과정을 DBMS에서는 MVCC라고 표현함
- 하나의 레코드에 대해 2개의 버전이 유지되고 필요에 따라 어느 데이터를 보일지 상황에 따라 달라지는 구조
- 관리해야 하는 예전 버전이 무한히 많아질 수도
    - 트랜잭션이 길어질 경우 언두에서 관리하는 데이터가 오래 남게 됨
- 커밋 시 지금 상태를 영구적인 상태로 만듬, 언두 로그는 바로 삭제되지 않고 이 영역을 필요로 하는 트랜잭션이 더는 없을 때 사라짐
- 롤백 시 언두 영역의 데이터를 버퍼 풀로 복구하고 언두 영역의 데이터를 삭제
- **잠금 없는 일관된 읽기**
    - 격리 수준이 SERIALIZABLE이 아닌 경우 INSERT와 연결되지 않은 순수한 읽기 작업은 다른 트랜잭션의 변경 작업과 관계 없이 항상 잠금을 대기하지 않고 바로 실행됨
    - 특정 사용자가 레코드를 변경하고 커밋하지 않았어도 다른 사용자의 SELECT 작업을 방해하지 않는다
    - 이를 잠금 없는 일관된 읽기라고 표현
    - 트랜잭션이 길어지면 언두 로그를 계속 유지해야 하므로 MySQL의 서버가 느려지거나 문제가 발생할 수 있다
    → 트랜잭션은 가능한 빨리 완료하자

### 자동 데드락 감지

- InnoDB 스토리지 엔진은 교착 상태 확인을 위해 잠금 대기 목록을 그래프(Wait-for List) 형태로 관리함
    - 데드락 감지 스레드가 주기적으로 이 그래프를 검사해 교착 상태에 빠진 트랜잭션 중 하나를 강제 종료함
- 어떤 걸 먼저 종료할 것인지 기준은 트랜잭션의 언두 로그 양
    - 더 적은 트랜잭션이 일반적으로 대상이 됨
    - 롤백을 해도 해야 할 언두 처리의 내용이 적으니까 MySQL 서버의 부하도 덜 유발하므로
- InnoDB 스토리지 엔진은 상위 레이어인 MySQL 엔진에서 관리되는 테이블 잠금은 볼 수 없어서 데드락 감지가 불확실할 수 있음
    - `innodb_table_locks` 시스템 변수를 활성화하면 감지할 수 있게됨 → 특별한 이유 없으면 활성화하자
- 일반적으로 부담되는 작업은 아니지만 동시 처리 스레드가 매우 많아지거나 잠금의 개수가 많아지면 데드락 감지 스레드가 느려짐
    - 데드락 감지 스레드는 잠금 목록이 저장된 리스트에 새로운 잠금을 걸고 데드락 스레드를 찾음
    - 따라서 이 스레드가 느려지면 서비스 쿼리를 처리 중인 스레드의 대기가 늘어나게 됨
- `innodb_deadlock_detect` 시스템 변수를 비활성화하면 데드락 감지 스레드가 작동하지 않게 됨
    - 그럼 데드락이 발생할 수 있게 되는데..
    - `innodb_lock_wait_timeout` 시스템 변수를 활성화하면 일정 시간 후 요청을 실패하게 함
        - 설정 시간 동안 잠금을 획득하지 못하면 쿼리 실패 후 예외 반환

### 자동화된 장애 복구

InnoDB에는 손실이나 장애로부터 데이터를 보호하기 위한 메커니즘이 여럿 있는데..

서버 시작할 때 이 메커니즘을 이용해 완료되지 못한 트랜잭션이나 일부만 기록된 데이터 페이지 등에 대한 복구 작업이 진행된다

근데 디스크나 하드웨어 이슈로 자동으로 복구를 못하는 경우가 생기는데 이러면 복구하기가 아주 어렵다
← 기본적으로 서버 시작 시 자동 복구를 수행하는데 자동 복구될 수 없는 손상이 있으면 복구를 멈추고 MySQL 서버를 종료
→ 이러면 `innodb_force_recovery`  시스템 변수를 설정해 서버를 시작해야 함(InnoDB 스토리지 엔진이 손상 여부 검사를 선별적으로 진행할 수 있게 함).
1에서 6까지의 값으로 설정하면 됨. 커질수록 심각한 상황

- 0이 아닌 복구 모드에서는 SELECT 이외의 쿼리는 수행이 불가
- 각 숫자에 대한 모드 확인은 책 106~107p 확인

이를 진행했음에도 서버가 시작되지 않으면 백업을 이용하는 방법밖엔 없다..ㅜ

### InnoDB 버퍼 풀

> 디스크의 데이터 파일이나 인덱스 정보를 메모리에 캐시해 두는 공간
> 

쓰기 작업을 지연시키고 일괄 작업으로 처리할 수 있게 해주는 버퍼 역할도 같이 함
← 데이터를 변경하는 쿼리는 일반적으로 랜덤한 디스크 작업을 발생시키는데 버퍼 풀이 이를 모아서 처리하므로 랜덤한 디스크 작업 횟수를 줄일 수 있음

- **크기 설정**
    - 운영체제와 각 클라이언트 스레드가 사용할 메모리를 충분히 고려해서 설정해야 함
    - MySQL 서버 내에서 메모리를 필요로 하는 부분은 잘 없지만 특별한 경우 레코드 버퍼가 상당한 메모리를 차지하기도 함
    - 레코드 버퍼: 각 클라이언트 세션이 테이블의 레코드를 읽고 쓸 때 버퍼로 사용하는 공간
        - 커넥션이 많고 사용하는 테이블이 많은 경우 메모리 공간이 많이 필요할 수도
        - 별도로 설정할 수 없고 커넥션 개수와 테이블의 개수에 따라 결정됨
        - 동적으로 해제되기도 하므로 필요한 메모리를 계산하기 어렵다
    - 근데 MySQL 5.7부터 동적으로 조절할 수 있게 개선됨ㅋㅋ
        - 일단 적절히 작은 값으로 설정한 후 점차 증가시키는 것이 최적
    - 이미 MySQL 서버가 있다면 그 메모리 설정을 기준으로 크기를 조절하면 됨ㅋㅋ
    - 근데 처음 준비해야 하면…
        - 전체 메모리 공간이 8GB면 50% 정도만 버퍼 풀로 설정
        - 전체 메모리 공간이 그 이상이면 50%에서 시작해 점차 올리면서 최적점 찾기
        - 전체 메모리 공간이 50GB 이상이라면 15~30GB 정도를 남겨두고 나머지는 다 할당 ㄱㄱ
    - `innodb_buffer_pool_size`  시스템 변수로 크기 설정 가능
        - 근데 이 변경은 크리티컬한 변경이니까 서버 덜 바쁠 때 진행하는 것이 좋다
        - 그리고 크기를 줄이는 건 서비스 영향도가 매우 크므로 웬만하면 하지 말어라~
    - 버퍼 풀은 내부적으로 128MB의 청크 단위로 관리됨
        - 줄이거나 늘일 때고 이 단위로 처리되니까 참고하셈
    - 원래는 버퍼 풀 전체 잠금(세마포어)를 썼어서 잠금 경합이 많이 있었는데
        - 이를 줄이기 위해 버퍼 풀을 여러 개로 쪼개어 관리할 수 있도록 개선됨
        - 개별 버퍼 풀 전체를 관리하는 잠금 경합이 분산되니까
    - 각 버퍼 풀을 `버퍼 풀 인스턴스`라고 한다
        - 기본적으로 이 개수는 8개로 초기화되지만
        - 버퍼 풀에 할당된 메모리 크기가 1GB 미만이면 1개만 생성됨
        - 메모리 크기가 크면 버퍼 풀 인스턴스당 5GB 정도가 되게 인스턴스 개수를 설정하는 것이 좋음
- **버퍼 풀의 구조**
    - InnoDB 스토리지 엔진은 버퍼 풀의 메모리 공간을 페이지 크기(`innodb_page_system`)의 조각으로 쪼갬
    → 스토리지 엔진이 데이터를 필요로 하면 해당 데이터 페이지를 읽어서 각 조각에 저장함
    - 페이지 크기 조각을 관리하기 위해 LRU(Least Recently Used) 리스트와 플러시 리스트, 프리 리스트라는 3개의 자료구조를 관리함
    - **프리 리스트**: 버퍼 풀에서 실제 사용자 데이터로 채워지지 않은 비어 있는 페이지들의 목록
        - 사용자 쿼리가 새롭게 디스크 데이터 페이지를 읽어와야 하는 경우 사용됨
    - **LRU 리스트**
        - 엄밀하게는 LRU + MRU의 형태라고 보면 됨
        - Old 서브리스트가 LRU, New 서브리스트가 MRU라고 이해하면 됨 ㅋ
        - 어떻게?
            - 버퍼 풀에 있는 것을 읽을 경우 MRU 방향으로 승급
                - MRU의 헤더로 이동한다
            - 새로 가져올 경우 5/8 지점(LRU에 가깝게)에 추가
            - 언제 쿼리가 접근했는지에 따라 나이가 부여됨
            → 오래되면 버퍼 풀에서 제거
            - 자주 접근되는 경우 해당 페이지의 인덱스 키를 어댑티브 해시 인덱스에 추가
        - 어댑티브 해시 인덱스: InnoDB 스토리지 엔진에서 자주 읽히는 데이터의 키값을 이용해 Hash Index를 만들고 필요할 때마다 원하는 레코드를 즉시 찾을 수 있게 함
        - 자주 사용되는 페이지는 MRU 영역에서 계속 살아남게 되고 사용되지 않는 페이지는 LRU의 끝까지 밀려나다가 버퍼 풀에서 삭제된다
    - **플러시 리스트**: 디스크로 동기화되지 않은 데이터를 가진 데이터 페이지의 변경 시점 기준의 페이지 목록
        - 디스크로부터 읽은 상태에서 변경이 가해지면 플러시 리스트에 관리
        → 특정 시점이 되면 디스크로 기록
        - 데이터가 변경되면 변경 내용을 리두 로그에 기록하고 버퍼 풀의 데이터 페이지에도 반영함
        그래서 리두 로그의 각 엔트리는 특정 데이터 페이지와 연결됨
        - but, 리두 로그가 디스크로 기록됐어도 데이터 페이지가 항상 디스크로 기록되는건 아니다(반대의 경우도 생길 수 있음)
        - InnoDB는 체크포인트를 발생시켜 디스크의 리두 로그와 데이터 페이지의 상태를 동기화함
            - 체크포인트는 MySQL 서버가 시작될 때 InnoDB가 리두 로그의 어느 부분부터 복구해야 할지 판단하는 기준점을 만드는 역할
